trunk/IFoam/examples/case_foam2vtk/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1-dev                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/cliffoi/OpenFOAM/cliffoi-1.4.1-dev/run/vtkInterfaceFoam";
    case "cavity";
    instance "0.5";
    local "";

    class volVectorField;
    object U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
400
(
(0.000253336 -0.000250529 0)
(0.000141099 0.000111382 0)
(-0.0011771 0.000564608 0)
(-0.00348132 0.000885014 0)
(-0.00637783 0.00104575 0)
(-0.00946999 0.00106179 0)
(-0.0124036 0.000957888 0)
(-0.0148858 0.000760472 0)
...
)
;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
