trunk/IFoam/examples/case_foam2vtk/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1-dev                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/cliffoi/OpenFOAM/cliffoi-1.4.1-dev/run/vtkInterfaceFoam";
    case "cavity";
    instance "0.5";
    local "";

    class surfaceScalarField;
    object phi;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
760
(
1.42259e-08
-1.42753e-08
-2.2215e-08
3.6441e-08
-1.14278e-07
9.20629e-08
-2.45509e-07
1.31231e-07
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           uniform 0;
    }
    fixedWalls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
